export const data = [
  {
    title: "张三",
    id: "x-1",
    tasks: [
      {
        title: "1在React中组件的更新渲染是从数据发生变化的根组件开始往子组件逐层重新渲染，而组件的生命周期有",
        startTime: 1635696000000,
        endTime: 1635955199000,
        id: "x-sub-1",
        state: 'error',
      },
      {
        title: "2单向数据流和数据双向绑定的区别还有各自的优缺点",
        startTime: 1635955200000,
        endTime: 1636127999000,
        id: "x-sub-2",
        state: 'success',
      },
      {
        title: "3单向数据流和数据双向绑定的区别还有各自的优缺点",
        startTime: 1636041600000,
        endTime: 1636300799000,
        id: "x-sub-3",
        state: 'primary',
        subTasks: [
          {
            title: "2先说说我为什么要做这么一个东西吧。最大原因就是自己太懒了，其次就是，后台管理这个东西，来来去去就是那么几个东西，查询，Form表单，Table表格，弹窗之类的一些东西，加上一个增删改查的一些逻辑，反正我呆过两家公司的后管都是这些，我猜大伙家的后管也不离其中吧。做久了这类东西，就感觉写代码没什么意思，复制黏贴，复制黏贴，一开始太开心的，做着做着，就开始迷茫了",
            startTime: 1636041600000,
            endTime: 1636127999000,
            id: "0subc-2",
          },
          {
            title: "2先说说我为什么要做这么一个东西吧。最大原因就是自己太懒了，其次就是，后台管理这个东西，来来去去就是那么几个东西，查询，Form表单，Table表格，弹窗之类的一些东西，加上一个增删改查的一些逻辑，反正我呆过两家公司的后管都是这些，我猜大伙家的后管也不离其中吧。做久了这类东西，就感觉写代码没什么意思，复制黏贴，复制黏贴，一开始太开心的，做着做着，就开始迷茫了",
            startTime: 1636128000000,
            endTime: 1636214399000,
            id: "0subc-1",
          },
          {
            title: "3先说说我为什么要做这么一个东西吧。最大原因就是自己太懒了，其次就是，后台管理这个东西，来来去去就是那么几个东西，查询，Form表单，Table表格，弹窗之类的一些东西，加上一个增删改查的一些逻辑，反正我呆过两家公司的后管都是这些，我猜大伙家的后管也不离其中吧。做久了这类东西，就感觉写代码没什么意思，复制黏贴，复制黏贴，一开始太开心的，做着做着，就开始迷茫了",
            startTime: 1636041600000,
            endTime: 1636300799000,
            id: "0subc-3",
          },
        ],
      },
      {
        title: "4化的根组件开始往子组件逐层",
        startTime: 1636300800000,
        endTime: 1636732799000,
        id: "x-sub-4",
        state: 'closed',
      },
      {
        title: "5化的根组件开始往子组件逐层",
        startTime: 1636732800000,
        endTime: 1637078399000,
        id: "x-sub-5",
        state: 'waiting',
      },
    ],
  },
];
